---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.CreateTemplateFromCurrentView
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.CreateTemplateFromCurrentView

Creates a view template using the properties of the current view as the basis for the new template.